Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/E13G.tmx
Source language: en_us
Languages: zh_cn

source: Quick chilli bean wraps
zh_cn: 墨西哥香辣什锦豆卷

source: These vegetarian Mexican wraps are self-assembled - great fun for all the family.
zh_cn: 快来动手为亲朋好友奉上美味可口的墨西哥素卷吧。

source: Easily doubled for a crowd, too
zh_cn: 做法简单，即使人多也可以轻松HOLD住。

source: Ingredients
zh_cn: 食材：

source: Serves 4
zh_cn: 四人份

source: 1 small onion, sliced
zh_cn: 1颗小洋葱，切片

source: 1 tbsp vegetable oil
zh_cn: 1勺植物油

source: 400g can mixed beans, drained and rinsed
zh_cn: 400克罐头什锦豆，控干水分，冲洗干净

source: 400g can chopped tomatoes
zh_cn: 400克罐头番茄

source: 30g sachet fajita seasoning (we like Discovery), or 2 tbsp Cajun seasoning
zh_cn: 30克装墨西哥卷调味包（要Discovery牌的），或者2勺凯郡调味料

source: 8 soft corn tortillas wraps (Old El Paso are good)
zh_cn: 8张墨西哥玉米饼（要Old El Paso牌的）

source: grated cheese , guacamole and soured cream
zh_cn: 少许干酪末、鳄梨酱和酸奶油

source: handful coriander or parsley, roughly chopped
zh_cn: 1把胡荽或欧芹，切碎

source: Method
zh_cn: 制作方法：

source: Gently fry onions for 5 mins in oil, until softened. Tip in beans, tomatoes and seasoning, then simmer for 10 mins, stirring occasionally.
zh_cn: 1.热油文火小炒洋葱5分钟至软熟，放入豆子、番茄和调味料炖10分钟，期间不时搅拌一下。

source: Meanwhile, warm the wraps in the microwave on High for 1 min.
zh_cn: 2.用微波炉高火加热玉米饼1分钟

source: Take a large spoonful of beans and spoon along the centre of each wrap.
zh_cn: 3.为每1张玉米饼上舀上1大勺什锦豆。

source: Top with some grated cheese, a spoonful of guacamole and soured cream and a sprinkling of coriander or parsley.
zh_cn: 之后再豆子上面撒上干酪末、1勺鳄梨酱和酸奶油，点缀胡荽或欧芹碎。

source: Wrap into a cigar shape and eat straight away.
zh_cn: 最后将玉米饼卷成雪茄状即食即可。

source: Nutrition per serving
zh_cn: 营养价值：

source: 320 kcalories
zh_cn: 卡路里：320千卡

source: protein 11.0g
zh_cn: 蛋白质：11.0克

source: carbohydrate 52.0g
zh_cn: 碳水化合物：52.0克

source: fat 9.0g
zh_cn: 脂肪：9.0克

source: saturated fat 1.0g
zh_cn: 饱和脂肪：1.0克

source: fibre 6.0g
zh_cn: 纤维素：6.0克

source: salt 3.98g
zh_cn: 盐：3.98克
